mutation/semantic/auth-any-client.patch
# category: authentication
# tests: tests/unit
# why: Tokens issued to any app client of the pool are accepted, not only ours.
--- a/app/presentation/security.py
+++ b/app/presentation/security.py
@@ -62,8 +62,6 @@
         raise unauthorized() from exc
     if claims.get("token_use") != "access":
         raise unauthorized("Not an access token")
-    if claims.get("client_id") not in settings.cognito_client_ids:
-        raise unauthorized("Token was issued to another application")
     subject = claims.get("sub")
     if not isinstance(subject, str) or not subject:
         raise unauthorized("Invalid subject")
