mutation/semantic/lock-product-row.patch
# category: concurrency
# tests: tests/integration
# why: Without the product row lock, two edits sent with the same If-Match both win: a lost update.
--- a/app/infrastructure/db/repositories.py
+++ b/app/infrastructure/db/repositories.py
@@ -327,7 +327,6 @@
         statement = (
             select(Product)
             .where(products.c.id == product_id, products.c.workspace_id == workspace_id)
-            .with_for_update()
             .execution_options(populate_existing=True)
         )
         return await self._session.scalar(statement)
