mutation/semantic/auth-id-tokens.patch
# category: authentication
# tests: tests/unit
# why: ID tokens pass as access tokens.
--- a/app/presentation/security.py
+++ b/app/presentation/security.py
@@ -60,8 +60,6 @@
     except jwt.PyJWTError as exc:
         logger.debug("Rejected token: {}", exc)
         raise unauthorized() from exc
-    if claims.get("token_use") != "access":
-        raise unauthorized("Not an access token")
     if claims.get("client_id") not in settings.cognito_client_ids:
         raise unauthorized("Token was issued to another application")
     subject = claims.get("sub")
