mutation/semantic/auth-origin-any-value.patch
# category: authentication
# tests: tests/unit
# why: Any x-origin-verify value passes: the function URL is reachable around CloudFront.
--- a/app/presentation/middleware.py
+++ b/app/presentation/middleware.py
@@ -19,7 +19,7 @@
     async def __call__(self, scope: Scope, receive: Receive, send: Send) -> None:
         if scope["type"] == "http" and scope["path"] not in _UNGUARDED_PATHS:
             sent = dict(scope["headers"]).get(ORIGIN_HEADER, b"")
-            if not hmac.compare_digest(sent, self._secret):
+            if not sent:
                 await JSONResponse({"detail": "Forbidden"}, status_code=403)(scope, receive, send)
                 return
         await self.app(scope, receive, send)
