mutation/semantic/lock-quota-row.patch
# category: concurrency
# tests: tests/integration
# why: Without the workspace row lock, concurrent creates all see room and overshoot the quota.
--- a/app/infrastructure/db/repositories.py
+++ b/app/infrastructure/db/repositories.py
@@ -107,7 +107,6 @@
         statement = (
             select(Workspace)
             .where(workspaces.c.id == workspace_id, self._live)
-            .with_for_update()
             .execution_options(populate_existing=True)
         )
         return await self._session.scalar(statement)
