mutation/semantic/purge-live-workspaces.patch
# category: data-loss
# tests: tests/integration
# why: The scheduled purge picks live workspaces too and deletes them for good.
--- a/app/infrastructure/db/repositories.py
+++ b/app/infrastructure/db/repositories.py
@@ -130,7 +130,6 @@
     async def deleted_ids(self, *, owned_by: str | None = None) -> list[str]:
         statement = (
             select(workspaces.c.id)
-            .where(workspaces.c.deleted_at.is_not(None))
             .order_by(workspaces.c.deleted_at)
         )
         if owned_by is not None:
