mutation/semantic/authz-slug-without-membership.patch
# category: authorization
# tests: tests/unit tests/e2e
# why: Any signed-in person reaches any workspace by guessing its slug.
--- a/app/application/access.py
+++ b/app/application/access.py
@@ -44,7 +44,7 @@
         uow = self._uow
         existing(await uow.users.get(user_id)).ensure_onboarded(ONBOARDED)
         workspace = await uow.workspaces.by_slug(slug)
-        if workspace is None or await uow.members.get(workspace.id, user_id) is None:
+        if workspace is None:
             raise NotFoundError(WORKSPACE_NOT_FOUND)
         if action is not None and not await permits(uow, user_id, action, workspace.id):
             raise ForbiddenError(PERMISSION_DENIED)
