mutation/semantic/registration-name-ignored.patch
# category: data-integrity
# tests: tests/unit tests/e2e
# why: A name given at registration no longer completes the profile step: the apps ask for it again.
--- a/app/domain/user.py
+++ b/app/domain/user.py
@@ -35,7 +35,7 @@
             display_name=name,
             avatar_url=None,
             avatar_key=None,
-            onboarding_status="workspace_pending" if name else "profile_pending",
+            onboarding_status="profile_pending",
             created_at=now(),
         )
 
