mutation/semantic/authz-update-route-reads.patch
# category: authorization
# tests: tests/e2e
# why: The product edit route asks for the read permission: viewers can edit the catalog.
--- a/app/presentation/routers/products.py
+++ b/app/presentation/routers/products.py
@@ -115,7 +115,7 @@
 async def update_product(
     product_id: str,
     payload: ProductUpdate,
-    scope: CanUpdateProducts,
+    scope: CanReadProducts,
     service: ProductServiceDep,
     if_match: Annotated[datetime | None, Header()] = None,
 ) -> ProductRead:
