mutation/semantic/schema-slug-not-unique.patch
# category: data-integrity
# tests: tests/integration
# why: The migration drops the unique slug: two workspaces answer at the same address.
--- a/migrations/versions/0001_initial_schema.py
+++ b/migrations/versions/0001_initial_schema.py
@@ -34,7 +34,7 @@
     CREATE TABLE workspaces (
         id text PRIMARY KEY,
         name text NOT NULL,
-        slug text NOT NULL UNIQUE,
+        slug text NOT NULL,
         owner_id text NOT NULL,
         logo_url text,
         logo_key text,
