mutation/semantic/side-effect-avatar-in-transaction.patch
# category: side-effects
# tests: tests/unit
# why: The old avatar is deleted inside the transaction: if the commit fails, the profile points at a deleted file.
--- a/app/application/accounts.py
+++ b/app/application/accounts.py
@@ -120,7 +120,10 @@
         async def replace() -> tuple[User, str | None]:
             user = existing(await uow.users.get(user_id))
             url = self._media.url_for(new_key) if new_key else None
-            return user, user.replace_avatar(new_key, url)
+            previous = user.replace_avatar(new_key, url)
+            if previous:
+                await self._media.delete(previous)
+            return user, None
 
         try:
             user, previous = await uow.transaction(replace)
