mutation/semantic/tenant-member-list.patch
# category: tenant-isolation
# tests: tests/integration tests/e2e
# why: The members page lists the people (names, emails) of every workspace.
--- a/app/infrastructure/db/repositories.py
+++ b/app/infrastructure/db/repositories.py
@@ -224,7 +224,6 @@
             select(Member, User, Role)
             .join(users, users.c.id == members.c.user_id)
             .join(roles, roles.c.id == members.c.role_id)
-            .where(members.c.workspace_id == workspace_id)
             .order_by(users.c.display_name, users.c.email)
         )
         return [(row[0], row[1], row[2]) for row in await self._session.execute(statement)]
