mutation/semantic/tenant-product-by-id.patch
# category: tenant-isolation
# tests: tests/integration tests/e2e
# why: A product id from another workspace loads, so anyone can read or edit any catalog.
--- a/app/infrastructure/db/repositories.py
+++ b/app/infrastructure/db/repositories.py
@@ -326,7 +326,7 @@
     async def get(self, workspace_id: str, product_id: str) -> Product | None:
         statement = (
             select(Product)
-            .where(products.c.id == product_id, products.c.workspace_id == workspace_id)
+            .where(products.c.id == product_id)
             .with_for_update()
             .execution_options(populate_existing=True)
         )
