mutation/semantic/stale-bulk-member-removal.patch
# category: data-integrity
# tests: tests/integration
# why: Removing a workspace's members as a Core DELETE leaves the loaded members in the session: later reads still find them.
--- a/app/infrastructure/db/repositories.py
+++ b/app/infrastructure/db/repositories.py
@@ -262,7 +262,7 @@
 
     async def remove_all(self, workspace_id: str) -> None:
         await self._session.execute(
-            delete(Member).where(members.c.workspace_id == workspace_id),
+            delete(members).where(members.c.workspace_id == workspace_id),
             execution_options=_SYNCED,
         )
 
